[ { "name": "Christof Vuille", "publication": "20 Minuten", "position": "Head of Politics", "country": "Switzerland", "bio": "Christof Vuille grew up in Bern, studied media studies, history, and law at the University of Fribourg. He has 14 years of experience in political journalism and is passionate about stories from the Federal Palace that resonate nationally. Currently, he is the head of politics at 20 Minuten." }, { "name": "Ryotaro Yamada", "publication": "Nikkei (US)", "position": "Silicon Valley Correspondent", "country": "Japan", "bio": "Ryotaro Yamada is based in Palo Alto, covering tech companies since 2023. Previously, he worked in Tokyo focusing on startups and the automotive industry, with experience in Japan’s business journalism." }, { "name": "Oliver Zihlmann", "publication": "Tamedia", "position": "Co-Head of Editorial", "country": "Switzerland", "bio": "Oliver Zihlmann specializes in data journalism, investigations into fiscal fraud, terrorism, and money laundering. He has contributed to international projects like Swiss Leaks and Panama Papers and holds advanced degrees in economics, sociology, and modern history." }, { "name": "Diana Romero", "publication": "Indómita Media / Fundación Periodistas Sin Cadenas", "position": "Editor / Project Coordinator", "country": "Ecuador", "bio": "Diana Romero focuses on social issues, gender, and human rights in her narrative reporting. She is a researcher and trainer on press freedom issues, awarded for her digital journalism work and fellowships." }, { "name": "Bárbara Rubira", "publication": "Rádio Novelo", "position": "Producer", "country": "Brazil", "bio": "Bárbara Rubira specializes in audio journalism and podcasts, coordinating popular series and collaborating with major media outlets. She holds a BA in Journalism from UFPR." }, { "name": "Céline Trachsel", "publication": "20 Minuten", "position": "Crime Reporter", "country": "Switzerland", "bio": "Céline Trachsel is a crime and investigative journalist with over 15 years of experience, passionate about legal journalism and regional reporting, especially around Zurich." }, { "name": "Lassi Lapintie", "publication": "Finnish News Agency STT", "position": "Foreign and Defense Reporter", "country": "Finland", "bio": "Lassi Lapintie reports on foreign affairs, defense, and security, with experience in conflict zones like Ukraine. He aims to improve investigative skills related to NATO and arms trade." }, { "name": "Maria Clara Matos", "publication": "CNN Brazil", "position": "Content Assistant", "country": "Brazil", "bio": "Maria Clara Matos is interested in public transparency and investigative journalism on government spending. She focuses on data-driven storytelling to promote accountability." }, { "name": "Emmanuel Mutaizibwa", "publication": "East Africa Center for Investigative Reporting", "position": "Managing Editor", "country": "Uganda", "bio": "Emmanuel Mutaizibwa is a journalist and lawyer, managing the investigative center. He has contributed to various international media outlets and produced films on organized crime and corruption." }, { "name": "Jineth Prieto", "publication": "La Silla Vacía", "position": "Coordinator of the Investigative Unit", "country": "Colombia", "bio": "Jineth Prieto leads investigative journalism efforts in Colombia, focusing on transparency, corruption, and social issues, often collaborating across borders." }, { "name": "Sarah Kunz", "publication": "Badener Tagblatt / Schweiz am Wochenende", "position": "Editor", "country": "Switzerland", "bio": "Sarah Kunz is dedicated to listening to unheard voices, with a focus on capturing human stories and fostering empathy through her journalism. She enjoys outdoor activities and cultural exploration." }, { "name": "Victor Amaya", "publication": "TalCual", "position": "Editorial Director", "country": "Venezuela", "bio": "Víctor Amaya has over a decade in journalism, transforming TalCual into a multimedia outlet and founding fact-checking initiatives. He reports internationally, including for BBC and Vice." }, { "name": "Astrid Arellano", "publication": "Mongabay Latam", "position": "Reporter", "country": "Mexico", "bio": "Astrid Arellano specializes in environmental and human rights reporting, focusing on Indigenous communities and ecological issues, with national awards recognizing her investigative work." }, { "name": "Rupen Boyadijian", "publication": "Finanz und Wirtschaft", "position": "Health Editor", "country": "Switzerland", "bio": "Rupen Boyadijian covers pharmaceutical and biotech industries, with a background in financial journalism and a focus on health sector developments." }, { "name": "Catherine Cochard", "publication": "24 Heures / Tribune de Genève", "position": "Journalist and Producer", "country": "Switzerland", "bio": "Catherine Cochard focuses on social issues like violence and harassment, with expertise in documentary film and media production, emphasizing social change." }, { "name": "Jim Hand-Cukierman", "publication": "Nikkei Asia", "position": "Editor for Greater China", "country": "Japan", "bio": "Jim Hand-Cukierman has been based in Japan since 2005, leading coverage of China, Hong Kong, and Taiwan, with a background in photojournalism and political editing." }, { "name": "Vienna Herrera", "publication": "Contracorriente", "position": "Editor and Investigative Journalist", "country": "Honduras", "bio": "Vienna Herrera reports on gender issues, corruption, and human rights, with numerous awards, fellowships, and cross-border investigative collaborations." }, { "name": "Benedikt Hollenstein", "publication": "20 Minuten", "position": "Editor and Reporter", "country": "Switzerland", "bio": "Benedikt Hollenstein covers a broad range of topics, with a passion for investigative journalism and modern conflicts, utilizing OSINT tools." }, { "name": "Jim Glade", "publication": "Latin America Reports", "position": "Managing Editor and Writer", "country": "Colombia", "bio": "Jim Glade writes and manages investigative and feature stories on Latin America, with work featured in major international outlets." }, { "name": "Ignacio Grimaldi", "publication": "La Nación", "position": "Reporter", "country": "Argentina", "bio": "Ignacio Grimaldi is a Buenos Aires-based journalist, with experience at La Nación, EFE, and CNN, focusing on politics, crime, and social issues." } ]
