[
  {
    "name": "Victor Amaya",
    "publication": "TalCual",
    "position": "Editorial Director",
    "country": "Venezuela",
    "bio": "Víctor Amaya is a Venezuelan journalist with over a decade of experience at TalCual, where he currently serves as Editorial Director and led the outlet’s transformation from print to a multimedia platform. He is the founder of EsPaja, a leading fact-checking initiative in Venezuela, and a member of Servicio de Información Pública. Based in Caracas, he reports for La Razón (Spain) and Radio France Internationale (France), and has contributed to international outlets including BBC, Vice, El Conﬁdencial, and TRT World. He is also the co-author of eight books of journalistic interviews. His work has earned him multiple accolades, including the 2025 King of Spain International Journalism Award."
  },
  {
    "name": "Astrid Arellano",
    "publication": "Mongabay Latam",
    "position": "Reporter",
    "country": "Mexico",
    "bio": "Astrid Arellano is a Mexican journalist specializing in environmental and human rights reporting. Based in the state of Sonora, in northwestern Mexico, her work explores the connections between Indigenous peoples and local communities, and their role in territorial defense and the conservation of Latin America's biodiversity. In 2019, she received Mexico’s National Journalism Award in the Reporting category for her investigation “Five Years After the Toxic Spill in the Sonora River,” which documented the most signiﬁcant environmental disaster caused by the mining industry in Mexico’s recent history. In 2021, she joined Mongabay Latam—an independent media organization focused on nature and global ecological challenges—to deepen her coverage of Indigenous and conservation-related issues."
  },
  {
    "name": "Rupen Boyadijian",
    "publication": "Finanz und Wirtschaft",
    "position": "Health Editor",
    "country": "Switzerland",
    "bio": "Rupen Boyadijian started his career in journalism as an Online News Editor at 20 Minuten, then at Tages-Anzeiger/Newsnet. From 2015 to 2017, he was the Desk Manager during the time Tamedia uniﬁed its Newsdesks (Newsexpress). He has navigated breaking news, conducted in-depth interviews, and led teams in delivering accurate stories. Since 2018, he has been an editor at Finanz und Wirtschaft, Switzerland’s leading ﬁnancial newspaper, covering mainly pharmaceutical and biotech companies."
  },
  {
    "name": "Catherine Cochard",
    "publication": "24 Heures and Tribune de Genève",
    "position": "Journalist and Producer",
    "country": "Switzerland",
    "bio": "Catherine Cochard is a Swiss journalist specializing in social issues. She currently works for 24 Heures, La Tribune de Genève and Le Matin Dimanche newspapers; she also produced podcasts. She holds a degree in contemporary art and interactive media. She also specialized in the art market, auctions, watchmaking, and the economy of companies in the luxury industry. Now she is focused on social issues such as violence towards women, harassment and sexist hate crimes. In parallel, she trained in documentary ﬁlm writing.   She began her career in the late 1990s as a multimedia designer, at a time when French-speaking Swiss newspapers were just starting to create their ﬁrst websites. This experience sparked her interest in journalism. She later worked as a writer at the Geneva-based agency Largenetwork, then joined the daily newspaper Le Temps, where she worked for several years."
  },
  {
    "name": "Jim Glade",
    "publication": "Latin America Reports",
    "position": "Managing Editor and Writer",
    "country": "Colombia",
    "bio": "Jim Glade is a managing editor and writer for Latin America Reports based in Medellín, Colombia. His work has been featured in Rolling Stone, The Atlantic, TechCrunch and more."
  },
  {
    "name": "Ignacio Grimaldi",
    "publication": "La Nación",
    "position": "Reporter",
    "country": "Argentina",
    "bio": "Ignacio Grimadi is a reporter for La Nación and is based in his hometown of Buenos Aires, Argentina. He started his career at La Nación as an intern, splitting his time between the newspaper and its TV channel, and also held an internship at Buenos Aires bureau’s Spanish news agency EFE, where he gained valuable experience as a reporter. In 2018, he joined CNN, where he was part of a team nominated for an Emmy for a documentary about the death of Argentine prosecutor Alberto Nisman. After six years at CNN, he returned to La Nación, where he is part of the economics team and contributes to various investigative projects — including reporting on the $Libra case and public contracting."
  },
  {
    "name": "Jim Hand-Cukierman",
    "publication": "Nikkei Asia",
    "position": "Editor for Greater China",
    "country": "Japan",
    "bio": "Jim Hand-Cukierman moved from Canada to Japan in 2005, intending to stay for a few years. Two decades and quite a few gray hairs later, he's still there. Most of that time has been spent at Nikkei Asia — as a copy editor, a political news editor and currently the editor leading coverage of China, Hong Kong and Taiwan. Jim got his start in journalism as a photography student in Paris, where he interned at Magnum Photos."
  },
  {
    "name": "Vienna Herrera",
    "publication": "Contracorriente",
    "position": "Editor and Investigative Journalist",
    "country": "Honduras",
    "bio": "Vienna Herrera is an editor and investigative journalist at Contracorriente in Honduras, where she focuses on gender issues, corruption, human rights, power structures, environmental conﬂicts, and extractivism. She is also involved in cross-border investigations in collaboration with regional and international media outlets. In 2020, she was a ﬁnalist for the Gabo Award and received third place in the Fetisov Journalism Awards for Excellence in Environmental Journalism as part of the transnational project Land of Resistants. She is a former fellow of the International Women's Media Foundation, the Global Investigative Journalism Network, and the Center for Media Integrity of the Americas (CMIA). In 2024, she was selected as a UN Reham Al-Farra (RAF) Journalism Fellow, covering high-level discussions at the UN General Assembly. She has also received training from the Gabo Foundation, the Knight Center for Journalism in the Americas, and the Inter-American Court of Human Rights (CorteIDH)."
  },
  {
    "name": "Benedikt Hollenstein",
    "publication": "Newsdesk, 20 Minuten",
    "position": "Editor and Reporter",
    "country": "Switzerland",
    "bio": "Benedikt Hollenstein is a Swiss journalist working for the newspaper 20 Minuten. Since his apprenticeship as a librarian, he lives out his passion and fascination for journalism. While covering a  broad range of topics in his work for 20 Minuten, he is particularly interested in modern conﬂicts and geopolitical events. He is an avid user of OSINT and the possibilities it opens up for journalists on a wide variety of topics. In his free time, Benedikt likes to travel and discover new places and cultures, and spending lots of time in nature, be it hiking, swimming or playing soccer with friends."
  },
  {
    "name": "Sarah Kunz",
    "publication": "Badener Tagblatt and Schweiz am Wochenende",
    "position": "Editor",
    "country": "Switzerland",
    "bio": "Sarah Kunz is an editor at Badener Tagblatt and Schweiz am Wochenede, Swiss newspapers. She is curious, eager to learn, interested, adventurous, empathetic, and compassionate – qualities that are deeply ingrained in her passion for journalism. She always wants to know more about our world and the people who live in it. She wants to listen to them, hear their stories, and capture what makes them who they are. She is a journalist because she wants to oﬀer a listening ear to those who are unheard and give a voice to those who can’t speak up. In doing so, she hopes to make the world just a little bit better today than it was yesterday. This is what drives her – not only in her profession but also in her everyday life. She enjoys playing sports with her teammates and making her friends and family laugh. She reads. A lot. And she loves being outdoors in nature, discovering every corner of the planet. She wants to experience the entire world: to feel it, see it, hear it, and maybe someday even understand it."
  },
  {
    "name": "Lassi Lapintie",
    "publication": "Finnish News Agency STT",
    "position": "Foreign and defense reporter",
    "country": "Finland",
    "bio": "Lassi Lapintie is a reporter specializing in foreign aﬀairs, defense, and security policy, with a focus on the United States, Ukraine and many other European countries. They have experience with conﬂict journalism and have visited Ukraine several times over the course of the war. At Columbia, they are hoping to improve their investigative skills such as the use of FOIA requests in examining US politics and defense industry, especially in how it relates to allied countries like Finland through Nato, international arms trade and bilateral cooperation."
  },
  {
    "name": "Maria Clara Matos",
    "publication": "CNN",
    "position": "Content Assistant",
    "country": "Brazil",
    "bio": "Maria Clara Matos is a 25-year-old journalist from Brazil with a strong interest in public transparency and investigative reporting on how public money is spent. She has worked at CNN Brazil and other major media outlets, covering politics, economy, and social issues. Maria Clara is passionate about using journalism to uncover hidden patterns in government spending and to bring accountability through data-driven storytelling."
  },
  {
    "name": "Emmanuel Mutaizibwa",
    "publication": "East Africa Center for Investigative Reporting",
    "position": "Managing Editor",
    "country": "Uganda",
    "bio": "Emmanuel Mutaizibwa is a journalist and lawyer by profession whose career straddles both the print and broadcast platforms. He is currently the Managing Editor at the East African Centre for Investigative Reporting (EACIR), a non-profit media organization based in Kampala.  He previously worked at Nation Media Group (NMG), Uganda, as the politics and investigations editor. He has authored articles for the Organized Crime and Corruption Reporting Project (OCCRP), the UK-based Guardian newspaper, South Africa’s Sunday Times, the Institute of War and Peace Reporting, Forbidden Stories, and Zam Magazine, and produced films for Al-Jazeera Television, Vice Media Group & TRT World."
  },
  {
    "name": "Jineth Prieto",
    "publication": "La Silla Vacía",
    "position": "Coordinator of the Investigative Unit",
    "country": "Colombia",
    "bio": "Jineth Prieto is the Coordinator of the Investigative Unit at La Silla Vacía. For 15 years, she has covered politics, corruption, and conﬂict in Colombia. She is co-author of the books El Dulce Poder and Los Presidenciables published by La Silla Vacía. She has won several regional and national journalism awards in Colombia."
  },
  {
    "name": "Sharmin Akter Rima",
    "publication": "cvoice24.com",
    "position": "Staﬀ Reporter",
    "country": "Bangladesh",
    "bio": "Sharmin Akter Rima is an investigative journalist based in Chattogram, Bangladesh, currently working with the online news outlet Cvoice24. Her work focuses on environmental issues, climate change, human rights, education, public health, and corruption in public services. She has received national recognition for her in-depth investigations, including awards for uncovering systemic corruption in local institutions and human rights issues, such as the Anti-Corruption Fellowship by Transparency International Bangladesh and the UNICEF Meena Media Award. Her stories have earned international acclaim, including recognition from the Global Investigative Journalism Network (GIJN) and the 2025 Radhuni Kirttimoti Award for outstanding reporting. Rima is passionate about storytelling that creates impact, and she looks forward to learning new investigative tools through the Columbia program to strengthen journalism in her country."
  },
  {
    "name": "Diana Romero",
    "publication": "Indómita Media and Project Coordinator, Fundación Periodistas Sin Cadenas",
    "position": "Editor",
    "country": "Ecuador",
    "bio": "Diana Romero is an Ecuadorian journalist specializing in narrative reporting, with a focus on social issues, gender, and human rights. She has contributed to various national and international media outlets and holds a Master’s degree in Digital Journalism from Universidad Casa Grande in Guayaquil. Diana is a former Fundación Gabo fellow, Dart Center Fellow (2022 and 2024), Pulitzer Center grantee, and a two-time winner of the Eugenio Espejo National Journalism Award (2022 and 2023) in the Best Digital Feature category. She currently serves as project coordinator at Fundación Periodistas Sin Cadenas, where she monitors press freedom violations in Ecuador and leads safety training for journalists."
  },
  {
    "name": "Bárbara Rubira",
    "publication": "Rádio Novelo",
    "position": "Producer",
    "country": "Brazil",
    "bio": "Bárbara Rubira is a Brazilian journalist specializing in audio journalism and narrative podcasts. Currently, she is a producer at Rádio Novelo, one of Brazil's leading podcast production companies. At Novelo, she has coordinated series such as Tempo Quente and Nenê da Brasilândia and is part of the team that makes the weekly podcasts Rádio Novelo Apresenta and Foro de Teresina.  Previously, she worked with daily news podcasts and special editorial projects at the newspaper O Estado de S. Paulo. Rubira is also a freelance reporter and producer, and has collaborated with piauí magazine, UOL, and Rádio Eldorado. Born and raised in Curitiba, Paraná, she holds a BA in Journalism from UFPR (Universidade Federal do Paraná)."
  },
  {
    "name": "Céline Trachsel",
    "publication": "20 Minuten",
    "position": "Deputy Manager",
    "country": "Switzerland",
    "bio": "Céline Trachsel is a crime reporter at 20 Minuten, Switzerland’s largest news platform. Raised in the Canton of Bern, she studied journalism at the Zurich University of Applied Sciences (ZHAW) and recently completed a Bachelor of Law. With over 15 years of newsroom experience, she has covered everything from major court cases to crime and social aﬀairs. Trachsel is especially passionate about investigative reporting and legal journalism. Her career has included key editorial roles at Ringier and Tamedia, and she currently focuses on regional news in the Zurich area.   Christof Vuille Head of Politics, 20 Minuten Christof Vuille grew up in the canton of Bern and studied media studies, history and law at the University of Fribourg. He has worked in political journalism for 14 years and is passionate about stories from the Federal Palace that resonate across the country and spark public debate. He is currently the head of politics at 20 Minuten, Switzerland’s largest media outlet. In his free time, he enjoys jogging, swimming in the river, and spending time with friends."
  },
  {
    "name": "Ryotaro Yamada",
    "publication": "Nikkei",
    "position": "Silicon Valley Correspondent",
    "country": "U.S.",
    "bio": "Ryotaro Yamada is a Silicon Valley Correspondent for Nikkei, based out of Palo Alto since 2023, covering tech companies for Japan’s leading business newspaper. From 2018 to 2023, he worked in Tokyo as a business reporter, covering Japan’s startup ecosystem and later focusing on the automotive industry."
  },
  {
    "name": "Oliver Zihlmann",
    "publication": "Tamedia",
    "position": "Co-Head of Editorial",
    "country": "Switzerland",
    "bio": "Oliver Zihlmann, Switzerland, is Co-Head of Tamedia Editorial Company's joint investigation team in Switzerland. He and his team focus on data journalism projects and large investigations on subjects such as ﬁscal fraud, terrorism, money laundering and crime. Zihlmann helped lead the Swiss teams working on ICIJ projects including Swiss Leaks, Luxleaks and the Panama Papers. He began his professional career in national television, worked as a correspondent in Berlin and wrote a book on a diplomatic scandal in Germany. He studied in Basel, Zurich and Bologna and has a master's in economics and sociology, and a doctorate in modern history."
  }
]
